target/classes/testdata/requestContent

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2" xmlns:add="http://integration.sprint.com/interfaces/addPayment/v1/addPayment.xsd">
   <soapenv:Header>
        <v2:wsMessageHeader>
         <v2:trackingMessageHeader>
            <v2:applicationId>N01</v2:applicationId>
            <v2:applicationUserId>System</v2:applicationUserId>
            <!--Optional:-->
            <v2:consumerId>2345</v2:consumerId>
            <!--Optional:-->
            <v2:messageId>4543</v2:messageId>
            <v2:conversationId>564</v2:conversationId>
            <v2:timeToLive>60</v2:timeToLive>
            <v2:messageDateTimeStamp>2015-03-19T09:27:30.127-04:00</v2:messageDateTimeStamp>
         </v2:trackingMessageHeader>
         <!--Optional:-->
      </v2:wsMessageHeader>
   </soapenv:Header>
   <soapenv:Body>
     <add:addPayment>
         <add:billingAccountNumberInformation>
            <add:billingAccountNumber>266752971</add:billingAccountNumber>
            <!--<add:mobileDirectoryNumber>3167559193</add:mobileDirectoryNumber>-->
         </add:billingAccountNumberInformation>
         <add:paymentInfo>
            <add:allowDuplicateInd>true</add:allowDuplicateInd>
            <add:paymentMethod>CK</add:paymentMethod>
            <add:paymentSubMethod>AM</add:paymentSubMethod>
            <add:paymentAmount>116</add:paymentAmount>
            <add:sourceId>HNDSTMOB</add:sourceId>
            <add:sourceType>O</add:sourceType>
            <add:bankAccountNumber>0888271156</add:bankAccountNumber>
            <add:bankCode>122000247</add:bankCode>
            <add:checkNum>444903324</add:checkNum>
            <!--add:creditCardReqInfo>
               <add:creditCardNumber>371144371144376</add:creditCardNumber>
               <add:creditCardExpDate>2016-12-31</add:creditCardExpDate>
               <add:securityCode>1234</add:securityCode>
               <add:zipCode>61820</add:zipCode>
            </add:creditCardReqInfo-->
         </add:paymentInfo>
      </add:addPayment>
   </soapenv:Body>
</soapenv:Envelope>